# IV. Database

Indice

### Import Libraries and PyPower.py

In [56]:
import pandas as pd
import numpy as np
from sys import displayhook
import sys
sys.path.append('../Python')
from  PyPower import *

### DataFrame analysis

In [57]:
data  = pd.read_csv('../../data/2-processed/data.csv')
original_shape= data.shape
data.head()

,order_id,created_datetime,brand,location,channel,status,type,total,payment_method,delivery_cost,discount,tip,driver_tip,subtotal,vat,software
0,AULRBGNM,2023-11-03 14:46:46,Tepuy Burger,Tepuy Burger - Rodolfo Salazar,glovo,DELIVERED,DELIVERY,26.9,CARD,0.0,0.0,0.0,0.0,26.9,0.0,otter
1,B1YBHZJW,2023-11-03 14:40:15,Tepuy Burger,Tepuy Burger - Benidorm,glovo,DELIVERED,DELIVERY,51.5,CARD,0.0,0.0,0.0,0.0,51.5,0.0,otter
2,ALMVLKTB,2023-11-03 14:23:06,Tepuy Burger,Tepuy Burger - Rodolfo Salazar,glovo,DELIVERED,DELIVERY,26.9,CARD,0.0,0.0,0.0,0.0,26.9,0.0,otter
3,BXVJAQHE,2023-11-02 22:32:27,Tepuy Burger,Tepuy Burger - Benidorm,glovo,DELIVERED,DELIVERY,40.9,CARD,0.0,0.0,0.0,0.0,40.9,0.0,otter
4,ABUGGFKZ,2023-11-02 22:28:20,Tepuy Burger,Tepuy Burger - Calle Bazan,glovo,CANCELED,DELIVERY,20.4,CARD,0.0,0.0,0.0,0.0,20.4,0.0,otter

### New tables

#### Brand table

In [58]:
brand = new_table(data, 'brand', True, 'brand_id','brand')

brand

  brand_id         brand
0        1  Tepuy Burger

#### Location table

In [59]:
location = new_table(data, 'location', True, 'location_id','location')

location

  location_id                        location
0           1  Tepuy Burger - Rodolfo Salazar
1           2         Tepuy Burger - Benidorm
2           3      Tepuy Burger - Calle Bazan

#### Channel table

In [60]:
channel = new_table(data, 'channel', True, 'channel_id','channel')

channel

  channel_id       channel
0          1         glovo
1          2      ubereats
2          3  gloria_foods
3          4      just_eat

#### Status table

In [61]:
status = new_table(data, 'status', True, 'status_id','status')

status

  status_id     status
0         1  DELIVERED
1         2   CANCELED
2         3        NEW
3         4   ACCEPTED

#### Order Type table

In [62]:
order_type = new_table(data, 'type', True, 'order_type_id','order_type')

order_type

  order_type_id order_type
0             1   DELIVERY

#### Sotfware table

In [63]:
software = new_table(data, 'software', True, 'software_id','software')

software

  software_id    software
0           1       otter
1           2  deliverect

### Change values for ids in the data DataFrame
That will be our ORDER TABLE

In [64]:
#Create new columns

data['location_id'] = np.nan
data['brand_id'] = np.nan
data['channel_id'] = np.nan
data['status_id'] = np.nan
data['order_type_id'] = np.nan
data['software_id'] = np.nan

In [65]:
#Use fill_column method to asign the value depending on the new tables ids. Order_type_id is 0 for now

data = data.apply(fill_column, df_to_compare=location, column_to_compare='location', column_to_change='location_id', axis=1)
data = data.apply(fill_column, df_to_compare=channel, column_to_compare='channel', column_to_change='channel_id', axis=1)
data = data.apply(fill_column, df_to_compare=brand, column_to_compare='brand', column_to_change='brand_id', axis=1)
data = data.apply(fill_column, df_to_compare=status, column_to_compare='status', column_to_change='status_id', axis=1)
data = data.apply(fill_column, df_to_compare=software, column_to_compare='software', column_to_change='software_id', axis=1)
data.order_type_id= '0'

In [66]:
data.head()

,order_id,created_datetime,brand,location,channel,status,type,total,payment_method,delivery_cost,...,driver_tip,subtotal,vat,software,location_id,brand_id,channel_id,status_id,order_type_id,software_id
0,AULRBGNM,2023-11-03 14:46:46,Tepuy Burger,Tepuy Burger - Rodolfo Salazar,glovo,DELIVERED,DELIVERY,26.9,CARD,0.0,...,0.0,26.9,0.0,otter,1,1,1,1,0,1
1,B1YBHZJW,2023-11-03 14:40:15,Tepuy Burger,Tepuy Burger - Benidorm,glovo,DELIVERED,DELIVERY,51.5,CARD,0.0,...,0.0,51.5,0.0,otter,2,1,1,1,0,1
2,ALMVLKTB,2023-11-03 14:23:06,Tepuy Burger,Tepuy Burger - Rodolfo Salazar,glovo,DELIVERED,DELIVERY,26.9,CARD,0.0,...,0.0,26.9,0.0,otter,1,1,1,1,0,1
3,BXVJAQHE,2023-11-02 22:32:27,Tepuy Burger,Tepuy Burger - Benidorm,glovo,DELIVERED,DELIVERY,40.9,CARD,0.0,...,0.0,40.9,0.0,otter,2,1,1,1,0,1
4,ABUGGFKZ,2023-11-02 22:28:20,Tepuy Burger,Tepuy Burger - Calle Bazan,glovo,CANCELED,DELIVERY,20.4,CARD,0.0,...,0.0,20.4,0.0,otter,3,1,1,2,0,1

In [67]:
data.columns

Index(['order_id', 'created_datetime', 'brand', 'location', 'channel',
       'status', 'type', 'total', 'payment_method', 'delivery_cost',
       'discount', 'tip', 'driver_tip', 'subtotal', 'vat', 'software',
       'location_id', 'brand_id', 'channel_id', 'status_id', 'order_type_id',
       'software_id'],
      dtype='object')

In [68]:
data.drop(columns = ['software', 'location', 'brand', 'channel', 'status', 'type'], inplace=True)

In [69]:
data.head()

,order_id,created_datetime,total,payment_method,delivery_cost,discount,tip,driver_tip,subtotal,vat,location_id,brand_id,channel_id,status_id,order_type_id,software_id
0,AULRBGNM,2023-11-03 14:46:46,26.9,CARD,0.0,0.0,0.0,0.0,26.9,0.0,1,1,1,1,0,1
1,B1YBHZJW,2023-11-03 14:40:15,51.5,CARD,0.0,0.0,0.0,0.0,51.5,0.0,2,1,1,1,0,1
2,ALMVLKTB,2023-11-03 14:23:06,26.9,CARD,0.0,0.0,0.0,0.0,26.9,0.0,1,1,1,1,0,1
3,BXVJAQHE,2023-11-02 22:32:27,40.9,CARD,0.0,0.0,0.0,0.0,40.9,0.0,2,1,1,1,0,1
4,ABUGGFKZ,2023-11-02 22:28:20,20.4,CARD,0.0,0.0,0.0,0.0,20.4,0.0,3,1,1,2,0,1

### Export clean DataFrames

In [72]:
data.to_csv('../../data/3-fill_db/order.csv', index=False)

location.to_csv('../../data/3-fill_db/location.csv', index=False)

brand.to_csv('../../data/3-fill_db/brand.csv', index=False)

channel.to_csv('../../data/3-fill_db/channel.csv', index=False)

status.to_csv('../../data/3-fill_db/status.csv', index=False)

order_type.to_csv('../../data/3-fill_db/order_type.csv', index=False)

software.to_csv('../../data/3-fill_db/software.csv', index=False)